Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement
The current measurement state in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.AddRedlinesToCurrentSavedViewpoint
Converts the measurement to redlines. Then adds the redlines to the current saved viewpoint.
If there is no current saved viewpoint, then one is created.
Throws System.NotSupportedException:
Cannot convert to Redlines
Throws System.NotSupportedException:
No active viewer
Throws System.InvalidOperationException:
Failed to add redlines to current saved viewpoint
Throws System.NotSupportedException:
Cannot convert to Redlines
Throws System.NotSupportedException:
No active viewer
Throws System.InvalidOperationException:
Failed to add redlines to current saved viewpoint

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.CanConvertToRedlines
Determines if the measurement can be converted to redlines

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.Difference
Returns the difference
Throws System.NotSupportedException:
Difference not set
Throws System.NotSupportedException:
Difference not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.EndPoint
Returns the end point
Throws System.NotSupportedException:
EndPoint not set
Throws System.NotSupportedException:
EndPoint not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.FirstPoint
Returns the first point
Throws System.NotSupportedException:
FirstPoint not set
Throws System.NotSupportedException:
FirstPoint not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.HasDifference
Determines if the difference is available

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.HasEndPoint
Determines if the end point is available

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.HasFirstPoint
Determines if the first point is available

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.HasMeasurement
Determines if the MeasurementValue and MeasurementType are available

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.MeasurementType
Returns the measurement type
Throws System.NotSupportedException:
Measurement not set
Throws System.NotSupportedException:
Measurement not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.MeasurementValue
Returns the measurement value
Throws System.NotSupportedException:
Measurement not set
Throws System.NotSupportedException:
Measurement not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.Tool
Returns the measurement tool in use

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.ToolMeasurementType
Returns the tool measurement type